app/Http/Controllers/SharwaliTarifa.php

select * from `customer_numerahas` where `customer_numerahas`.`id` = '28' limit 1
select * from `customers` where `customers`.`id` in (9)
---
    public function downloadInvoice($id)
    {
        $filament = CustomerNumeraha::with(['customer', 'numeraha'])->find($id);