app/Filament/Resources/NumerahaResource.php

select count(*) as aggregate from `customers` inner join `customer_numerahas` on `customers`.`id` = `customer_numerahas`.`customer_id` where `customer_numerahas`.`numeraha_id` = 24815
---
                Tables\Columns\TextColumn::make('numera_id')
                    ->sortable()
                    ->toggleable(),
                BadgeableColumn::make('numera_id')
                    ->label('د نمری آی ډی')
                    ->searchable()
                    ->suffixBadges([
                        Badge::make('hot')
                            ->label(fn($record) => ' مشتریان: ' . $record->customers()->count())
                            ->color('success')
                            ->visible(fn($record) => $record->customers()->count() > 0),
                    ]),